Revit 2027 API
AddInIdAttribute Constructor
Constructs a new AddInIdAttribute.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AddInIdAttribute(
	string addInIdStr
)
Public Sub New (
	addInIdStr As String
)
public:
AddInIdAttribute(
	String^ addInIdStr
)
new :
        addInIdStr : string -> AddInIdAttribute
Parameters
addInIdStr String
See Also
Reference
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace